[
  {
    "id": 1,
    "identifier": "USA",
    "name": "United States",
    "flagCode": "us",
    "about": "Co-host of the 2026 World Cup, the United States returns as a rising football nation with growing MLS influence and strong youth development. The team reached the 2002 quarterfinals and continues investing heavily in global competitiveness.",
    "group": "D"
  },
  {
    "id": 2,
    "identifier": "CAN",
    "name": "Canada",
    "flagCode": "ca",
    "about": "Canada hosts its first men’s World Cup matches in 2026 after a historic modern resurgence. Powered by a new golden generation, the team qualified impressively for Qatar 2022, signaling its emergence as a serious CONCACAF contender.",
    "group": "B"
  },
  {
    "id": 3,
    "identifier": "MEX",
    "name": "Mexico",
    "flagCode": "mx",
    "about": "Mexico becomes the first nation to host three World Cups, reinforcing its deep football culture. Known for passionate supporters and consistent knockout-stage appearances, El Tri remains one of the most experienced teams in tournament history.",
    "group": "A"
  },
  {
    "id": 4,
    "identifier": "PAN",
    "name": "Panama",
    "flagCode": "pa",
    "about": "Panama continues building on its historic 2018 World Cup debut, marking a golden era for the nation. Strong defensive organization and disciplined play have turned the team into a competitive force within CONCACAF qualifying cycles.",
    "group": "L"
  },
  {
    "id": 5,
    "identifier": "ARG",
    "name": "Argentina",
    "flagCode": "ar",
    "about": "Reigning world champions after their triumph in Qatar 2022, Argentina blends historic legacy with modern tactical identity. With multiple titles and legendary players across generations, La Albiceleste remains a perennial favorite.",
    "group": "J"
  },
  {
    "id": 6,
    "identifier": "BRA",
    "name": "Brazil",
    "flagCode": "br",
    "about": "The only nation to appear in every World Cup, Brazil holds a record five titles and a tradition of attacking brilliance. Famous for producing iconic talents, the Seleção continues to symbolize creativity and excellence in global football.",
    "group": "C"
  },
  {
    "id": 7,
    "identifier": "COL",
    "name": "Colombia",
    "flagCode": "co",
    "about": "Colombia returns with its characteristic technical style and passionate fan base. The team achieved its best result in 2014 by reaching the quarterfinals and remains known for dynamic attacking play and strong performances in South America.",
    "group": "K"
  },
  {
    "id": 8,
    "identifier": "ECU",
    "name": "Ecuador",
    "flagCode": "ec",
    "about": "Ecuador has become one of South America’s most physically intense teams, combining altitude-conditioned endurance with emerging young talent. Consistent recent qualifications highlight its evolution into a competitive CONMEBOL side.",
    "group": "E"
  },
  {
    "id": 9,
    "identifier": "HAI",
    "name": "Haiti",
    "flagCode": "ht",
    "about": "Haiti reaches a historic milestone with qualification, showcasing rapid football development and resilience. Known for speed and attacking ambition, the team represents one of the most inspiring growth stories in international football.",
    "group": "C"
  },
  {
    "id": 10,
    "identifier": "URY",
    "name": "Uruguay",
    "flagCode": "uy",
    "about": "Two-time world champions and one of football’s historic pioneers, Uruguay blends tradition with a new generation of talent. Famous for competitive spirit and tactical discipline, La Celeste consistently punches above its population size.",
    "group": "H"
  },
  {
    "id": 11,
    "identifier": "PAR",
    "name": "Paraguay",
    "flagCode": "py",
    "about": "Paraguay returns to the global stage known for defensive solidity and collective organization. The team reached the 2010 quarterfinals and has historically challenged stronger nations through resilience and tactical discipline.",
    "group": "D"
  },
  {
    "id": 12,
    "identifier": "ENG",
    "name": "England",
    "flagCode": "gb-eng",
    "about": "World champions in 1966, England combines historic prestige with a modern generation of elite players competing in top European leagues. Recent deep tournament runs reflect renewed optimism around the Three Lions’ international ambitions.",
    "group": "L"
  },
  {
    "id": 13,
    "identifier": "FRA",
    "name": "France",
    "flagCode": "fr",
    "about": "One of football’s modern powerhouses, France has won multiple World Cups and reached consecutive finals in recent editions. Renowned for elite academies and tactical depth, Les Bleus consistently produce world-class talent.",
    "group": "I"
  },
  {
    "id": 14,
    "identifier": "ESP",
    "name": "Spain",
    "flagCode": "es",
    "about": "Champions in 2010, Spain revolutionized football with possession-based dominance. Known for technical precision and academy development, La Roja continues rebuilding with a new generation aiming to restore its golden-era success.",
    "group": "H"
  },
  {
    "id": 15,
    "identifier": "CRO",
    "name": "Croatia",
    "flagCode": "hr",
    "about": "A nation of remarkable consistency, Croatia reached the 2018 final and finished third in 2022. Despite its small population, the team excels through tactical intelligence, midfield quality, and strong tournament mentality.",
    "group": "L"
  },
  {
    "id": 16,
    "identifier": "GER",
    "name": "Germany",
    "flagCode": "de",
    "about": "Four-time world champions, Germany remains synonymous with efficiency and tournament pedigree. Known for structured play and relentless competitiveness, Die Mannschaft continues rebuilding while maintaining elite international standards.",
    "group": "E"
  },
  {
    "id": 17,
    "identifier": "POR",
    "name": "Portugal",
    "flagCode": "pt",
    "about": "Portugal blends technical excellence with tactical flexibility, highlighted by its Euro 2016 triumph. A steady producer of elite talent, the nation consistently competes deep into tournaments with an evolving attacking identity.",
    "group": "K"
  },
  {
    "id": 18,
    "identifier": "NED",
    "name": "Netherlands",
    "flagCode": "nl",
    "about": "Famous for Total Football philosophy, the Netherlands has reached multiple World Cup finals despite never winning the title. Oranje remains admired worldwide for tactical innovation and commitment to attacking football principles.",
    "group": "F"
  },
  {
    "id": 19,
    "identifier": "BEL",
    "name": "Belgium",
    "flagCode": "be",
    "about": "Belgium’s golden generation elevated the nation to consistent top FIFA rankings, highlighted by a third-place finish in 2018. Known for technical versatility and attacking creativity, the Red Devils remain dangerous opponents.",
    "group": "G"
  },
  {
    "id": 20,
    "identifier": "AUT",
    "name": "Austria",
    "flagCode": "at",
    "about": "Austria’s resurgence reflects strong tactical organization and improved youth development. Historically competitive in Europe, the team now seeks to translate consistent qualification performances into deeper World Cup runs.",
    "group": "J"
  },
  {
    "id": 21,
    "identifier": "SCO",
    "name": "Scotland",
    "flagCode": "gb-sct",
    "about": "Scotland returns driven by passionate supporters and a proud football tradition. Known for intensity and collective spirit, the national team aims to build on renewed competitiveness after decades away from major tournaments.",
    "group": "C"
  },
  {
    "id": 22,
    "identifier": "SUI",
    "name": "Switzerland",
    "flagCode": "ch",
    "about": "Switzerland has become one of Europe’s most consistent teams, regularly advancing from group stages. Built on defensive organization and disciplined structure, the squad combines experience with technically refined players.",
    "group": "B"
  },
  {
    "id": 23,
    "identifier": "NRW",
    "name": "Norway",
    "flagCode": "no",
    "about": "Norway returns to the World Cup spotlight with a new generation of attacking stars. Historically competitive in the 1990s, the nation now seeks to reestablish itself globally through physical strength and modern tactical evolution.",
    "group": "I"
  },
  {
    "id": 24,
    "identifier": "AUS",
    "name": "Australia",
    "flagCode": "au",
    "about": "Australia continues its strong AFC era after memorable knockout-stage appearances. Known for resilience and physical intensity, the Socceroos consistently exceed expectations through collective organization and fighting spirit.",
    "group": "D"
  },
  {
    "id": 25,
    "identifier": "JPN",
    "name": "Japan",
    "flagCode": "jp",
    "about": "Japan stands among Asia’s most technically refined teams, famous for discipline and tactical execution. Historic wins over major nations in recent tournaments highlight its evolution into a respected global competitor.",
    "group": "F"
  },
  {
    "id": 26,
    "identifier": "KOR",
    "name": "South Korea",
    "flagCode": "kr",
    "about": "South Korea, semifinalists in 2002, combines relentless work rate with growing technical quality. Regular World Cup participants, the Taegeuk Warriors remain Asia’s most experienced side on football’s biggest stage.",
    "group": "A"
  },
  {
    "id": 27,
    "identifier": "IRN",
    "name": "Iran",
    "flagCode": "ir",
    "about": "Iran continues its dominance in Asian qualifying, known for defensive structure and tactical discipline. Consistent World Cup appearances underline the team’s stability and competitive strength within the AFC region.",
    "group": "G"
  },
  {
    "id": 28,
    "identifier": "JOR",
    "name": "Jordan",
    "flagCode": "jo",
    "about": "Jordan celebrates a historic first World Cup qualification, marking rapid football growth in the nation. Strong collective organization and defensive resilience helped secure one of Asia’s most inspiring qualification stories.",
    "group": "J"
  },
  {
    "id": 29,
    "identifier": "UZB",
    "name": "Uzbekistan",
    "flagCode": "uz",
    "about": "Uzbekistan reaches its first World Cup after years of near misses in Asian qualifying. Built on disciplined structure and emerging technical talent, the team represents Central Asia’s rise on the global football stage.",
    "group": "K"
  },
  {
    "id": 30,
    "identifier": "QAT",
    "name": "Qatar",
    "flagCode": "qa",
    "about": "After hosting the 2022 World Cup, Qatar continues developing its football identity through academy investment and tactical organization. The national project focuses on long-term competitiveness at the international level.",
    "group": "B"
  },
  {
    "id": 31,
    "identifier": "KSA",
    "name": "Saudi Arabia",
    "flagCode": "sa",
    "about": "Saudi Arabia remains a consistent Asian powerhouse, highlighted by famous World Cup upsets against global giants. Technical improvement and domestic league investment continue strengthening the Green Falcons’ competitiveness.",
    "group": "H"
  },
  {
    "id": 32,
    "identifier": "NZE",
    "name": "New Zealand",
    "flagCode": "nz",
    "about": "Dominant within Oceania, New Zealand returns to the World Cup aiming to repeat its unbeaten 2010 campaign. Known for physical strength and aerial presence, the All Whites represent OFC’s strongest international contender.",
    "group": "G"
  },
  {
    "id": 33,
    "identifier": "ALG",
    "name": "Algeria",
    "flagCode": "dz",
    "about": "Algeria combines technical flair with passionate support, highlighted by its memorable 2014 Round of 16 performance. The Desert Foxes remain one of Africa’s most talented sides with strong attacking identity.",
    "group": "J"
  },
  {
    "id": 34,
    "identifier": "CPV",
    "name": "Cape Verde",
    "flagCode": "cv",
    "about": "Cape Verde achieves a historic World Cup debut, reflecting remarkable progress for a small island nation. Known for athleticism and tactical discipline, the team symbolizes African football’s expanding competitive diversity.",
    "group": "H"
  },
  {
    "id": 35,
    "identifier": "CUW",
    "name": "Curaçao",
    "flagCode": "cw",
    "about": "Curaçao reaches a landmark qualification fueled by diaspora talent and technical development. The Caribbean nation continues rising in CONCACAF, blending European-trained players with a dynamic attacking approach.",
    "group": "E"
  },
  {
    "id": 36,
    "identifier": "EGY",
    "name": "Egypt",
    "flagCode": "eg",
    "about": "Seven-time African champions, Egypt carries one of the continent’s richest football legacies. Known for passionate supporters and tactical discipline, the Pharaohs seek to translate continental success into World Cup impact.",
    "group": "G"
  },
  {
    "id": 37,
    "identifier": "GHA",
    "name": "Ghana",
    "flagCode": "gh",
    "about": "Ghana remains one of Africa’s most competitive World Cup teams, famously reaching the 2010 quarterfinals. Combining athleticism with emerging youth talent, the Black Stars consistently challenge top international opponents.",
    "group": "L"
  },
  {
    "id": 38,
    "identifier": "CIV",
    "name": "Ivory Coast",
    "flagCode": "ci",
    "about": "Ivory Coast blends physical strength with technical quality, continuing a legacy built by golden generations. Regular continental contenders, the Elephants aim to convert individual talent into collective World Cup success.",
    "group": "E"
  },
  {
    "id": 39,
    "identifier": "MAR",
    "name": "Morocco",
    "flagCode": "ma",
    "about": "Morocco stunned the world by reaching the 2022 semifinals, the best result ever by an African nation. Combining tactical discipline with passionate support, the Atlas Lions now enter tournaments as genuine contenders.",
    "group": "C"
  },
  {
    "id": 40,
    "identifier": "SEN",
    "name": "Senegal",
    "flagCode": "sn",
    "about": "African champions and consistent global competitors, Senegal is known for athletic intensity and defensive organization. Since its iconic 2002 debut run, the Lions of Teranga remain among Africa’s strongest teams.",
    "group": "I"
  },
  {
    "id": 41,
    "identifier": "ZAF",
    "name": "South Africa",
    "flagCode": "za",
    "about": "Host of the historic 2010 World Cup, South Africa returns seeking renewed international relevance. Backed by strong domestic support and developing talent pathways, Bafana Bafana aims to rebuild continental prominence.",
    "group": "A"
  },
  {
    "id": 42,
    "identifier": "TUN",
    "name": "Tunisia",
    "flagCode": "tn",
    "about": "Tunisia continues its record of consistent African qualifications, known for tactical discipline and defensive structure. Competitive performances against elite teams have reinforced its reputation as a difficult opponent.",
    "group": "F"
  }
]

